app/controllers/operator_controller.rb

  def answer
    messages = Message.find(:all)
    messages.each do |message|

      if message.query == 'query'
        # initial:

        article = Wikipedia.chunks(message.text,160)

        Sms.new_outgoing(article[0],message.number)

      elsif message.query == 'more'
        # asking for more

        # find last query:
        last = Message.find :last, :conditions => ["query != ?",'more']
        article = Wikipedia.chunks(last.text,160)

        # find out how many times we've asked
        mores = Message.find :all, :conditions => ['created_at > ?',last.created_at]

        Sms.new_outgoing(article[mores.length],message.number)
---
SELECT * FROM `messages` WHERE (status = 'received')
SELECT * FROM `messages`
INSERT INTO `messages` (`name`, `message_type`, `status`, `updated_at`, `number`, `text`, `sms_id`, `query`, `created_at`) VALUES('anonymous', 'incoming', 'received', '2009-11-09 14:58:10', '+14155086769', 'respond! lala!', 0, 'query', '2009-11-09 14:58:10')
SELECT * FROM `messages` WHERE (`messages`.`sms_id` = 0 AND `messages`.`text` = 'respond! lala!')