app/controllers/operator_controller.rb

  def answered
	messages = []
	Message.find(:all,:conditions => {:status => 'complete'}).map do |msg|
---
SELECT * FROM `messages` WHERE (`messages`.`status` = 'complete')